In [24]:
import pandas as pd
import numpy as np

In [25]:
df = pd.read_csv(r"C:\Users\ALKA\OneDrive\Desktop\Data Analytics project\Softnix internship\datasets\people-100000.csv")

In [26]:
df.head()

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
0,1,e09c4f4cbfEFaFd,Dawn,Trevino,Male,clintongood@example.org,360-423-5286,1972-01-17,"Teacher, primary school"
1,2,D781D28b845Ab9D,Dale,Mcknight,Male,clairebradshaw@example.org,9062423229,1931-01-31,"Development worker, community"
2,3,eda7EcaF87b2D80,Herbert,Bean,Female,johnnybooker@example.org,001-149-154-0679x1617,2018-02-10,Ceramics designer
3,4,E75ACea5D7AeC3e,Karen,Everett,Female,wkhan@example.org,870.294.7563x20939,1938-06-14,"Civil engineer, consulting"
4,5,9C4Df1246ddf543,Angela,Shea,Male,reginaldgarner@example.com,242.442.2978,1971-11-22,Health and safety adviser

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 9 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Index          100000 non-null  int64
 1   User Id        100000 non-null  object
 2   First Name     100000 non-null  object
 3   Last Name      100000 non-null  object
 4   Sex            100000 non-null  object
 5   Email          100000 non-null  object
 6   Phone          100000 non-null  object
 7   Date of birth  100000 non-null  object
 8   Job Title      100000 non-null  object
dtypes: int64(1), object(8)
memory usage: 6.9+ MB

In [28]:
df.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
99995    False
99996    False
99997    False
99998    False
99999    False
Length: 100000, dtype: bool

In [29]:
df.drop_duplicates()

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
0,1,e09c4f4cbfEFaFd,Dawn,Trevino,Male,clintongood@example.org,360-423-5286,1972-01-17,"Teacher, primary school"
1,2,D781D28b845Ab9D,Dale,Mcknight,Male,clairebradshaw@example.org,9062423229,1931-01-31,"Development worker, community"
2,3,eda7EcaF87b2D80,Herbert,Bean,Female,johnnybooker@example.org,001-149-154-0679x1617,2018-02-10,Ceramics designer
3,4,E75ACea5D7AeC3e,Karen,Everett,Female,wkhan@example.org,870.294.7563x20939,1938-06-14,"Civil engineer, consulting"
4,5,9C4Df1246ddf543,Angela,Shea,Male,reginaldgarner@example.com,242.442.2978,1971-11-22,Health and safety adviser
...,...,...,...,...,...,...,...,...,...
99995,99996,eDbebb82Bdf859c,Eduardo,Fuentes,Male,zacharygalloway@example.net,971-408-5795x791,2015-09-02,"Designer, graphic"
99996,99997,78B30216f7Ad5eA,Marcus,Ferguson,Male,qkane@example.org,001-183-966-1623x446,1978-01-30,Cytogeneticist
99997,99998,E0edBf053adCEc1,Marilyn,Benson,Male,jenny91@example.com,3010820886,1939-07-11,Engineering geologist
99998,99999,fA585A02f6A86C5,Felicia,Robbins,Female,imcneil@example.com,(753)522-4673,1942-02-05,Clinical cytogeneticist
99999,100000,FE35edEdE3BaC90,Jackie,Doyle,Male,emay@example.net,357.974.5692x909,1918-05-30,"Teacher, special educational needs"

In [30]:
df["First Name"].unique()

array(['Dawn', 'Dale', 'Herbert', 'Karen', 'Angela', 'Edward', 'Jane',
       'Jasmin', 'Dakota', 'Jean', 'Lucas', 'Cody', 'Tabitha', 'Mary',
       'Ashlee', 'Shari', 'Brandy', 'Clinton', 'Maureen', 'Alexis',
       'Tanya', 'Theodore', 'Donna', 'Natasha', 'Micheal', 'Albert',
       'Jodi', 'Larry', 'Sandy', 'Bryce', 'Patrick', 'Virginia',
       'Phillip', 'Tamara', 'Greg', 'Kristen', 'Anna', 'Catherine',
       'Sydney', 'Janet', 'Kurt', 'Reginald', 'Vickie', 'Maxwell',
       'Kristin', 'Franklin', 'Frank', 'Stanley', 'Sherri', 'Ruth',
       'Michael', 'Jocelyn', 'Jonathon', 'Jeanne', 'Shaun', 'Chelsey',
       'Marco', 'Calvin', 'Bryan', 'Aimee', 'Ellen', 'Anita', 'Kaylee',
       'Donald', 'Clarence', 'Dillon', 'Debra', 'Don', 'Alison', 'Darius',
       'Kim', 'Joann', 'Alex', 'Jaime', 'Troy', 'Christina', 'Shirley',
       'Tim', 'Gwendolyn', 'Michele', 'Mike', 'Garrett', 'Russell',
       'Abigail', 'Felicia', 'Louis', 'Nina', 'Henry', 'Priscilla',
       'Bruce', 'Devin', 'Claire', 'Melissa', 'Colton', 'Gloria',
       'Terrance', 'Belinda', 'Sheryl', 'Earl', 'Martin', 'Sarah',
       'Marisa', 'Joanna', 'Charlotte', 'Diamond', 'Kristi', 'Alfred',
       'Sierra', 'Adrian', 'Sheri', 'Tracey', 'Mackenzie', 'Stephen',
       'Daisy', 'Cameron', 'Geoffrey', 'Randy', 'Francis', 'Karina',
       'Kelly', 'Joanne', 'Spencer', 'Marc', 'Kylie', 'Jonathan', 'Jerry',
       'Xavier', 'Harry', 'Melanie', 'Noah', 'Isabel', 'Desiree',
       'Sandra', 'Mariah', 'Miranda', 'Danny', 'Oscar', 'Darryl',
       'Hector', 'Julian', 'Sally', 'Max', 'Brandon', 'Marvin', 'Bonnie',
       'Guy', 'Grant', 'Pedro', 'Brandi', 'Cynthia', 'Leon', 'Dorothy',
       'Alejandro', 'Barbara', 'Brenda', 'Natalie', 'Duane', 'Carrie',
       'Crystal', 'Caitlin', 'Brendan', 'Suzanne', 'Brooke', 'Alexa',
       'Gordon', 'Faith', 'Jackie', 'Samantha', 'Jade', 'Shelby', 'Emily',
       'Harold', 'Edgar', 'Gabrielle', 'Daryl', 'Craig', 'Mario', 'Derek',
       'Candice', 'Francisco', 'Alvin', 'Robin', 'Jo', 'Tracy',
       'Adrienne', 'Shelley', 'Renee', 'Lindsay', 'Jorge', 'Rebekah',
       'Krista', 'Dylan', 'Rita', 'Alexandra', 'Lydia', 'Wendy',
       'Gabriela', 'Stacey', 'Casey', 'Shane', 'Megan', 'Warren', 'Sonya',
       'Nichole', 'Tyler', 'Leah', 'Peggy', 'Robert', 'Hailey', 'Stacie',
       'Raven', 'Stacy', 'Nicolas', 'Meghan', 'Ethan', 'Elaine', 'Sophia',
       'Kristie', 'Emma', 'Samuel', 'Ryan', 'Jenny', 'Erica', 'Robyn',
       'Krystal', 'Bill', 'Mia', 'Hayley', 'Eric', 'Nicole', 'Caroline',
       'Madeline', 'Ana', 'Lindsey', 'Kristopher', 'Vanessa', 'Ronnie',
       'Chase', 'Lacey', 'Joshua', 'Luke', 'Patty', 'Erik', 'Lee',
       'Yolanda', 'Cheryl', 'Gina', 'Julia', 'Bailey', 'Meredith', 'Erin',
       'Chelsea', 'Eduardo', 'Eugene', 'Kent', 'Brittany', 'Madison',
       'Cory', 'Penny', 'Sonia', 'Jermaine', 'Bob', 'Kellie', 'Laura',
       'Randall', 'Dominic', 'Logan', 'Joel', 'Beverly', 'Brent',
       'Gilbert', 'Edwin', 'Glenda', 'Danielle', 'Curtis', 'Shawna',
       'Yesenia', 'Kelli', 'Joyce', 'Jaclyn', 'Corey', 'Vincent', 'Bobby',
       'Isabella', 'Marilyn', 'Chloe', 'Raymond', 'Teresa', 'Christine',
       'Jackson', 'Tanner', 'Dave', 'Devon', 'Mercedes', 'Seth', 'Neil',
       'Roberto', 'Ebony', 'Summer', 'Marcia', 'Preston', 'Kerri',
       'Mitchell', 'Sheena', 'Becky', 'Jeremy', 'Mark', 'Paul', 'Leonard',
       'Miguel', 'Ivan', 'Katie', 'Monica', 'Heather', 'Alan', 'Andre',
       'Bianca', 'Nicholas', 'Rose', 'Bridget', 'Savannah', 'Jacqueline',
       'Jessica', 'Bethany', 'Allison', 'Kevin', 'Jamie', 'Loretta',
       'Dwayne', 'Frances', 'Gabriel', 'Darlene', 'Mathew', 'Jennifer',
       'Destiny', 'Roger', 'Steve', 'Walter', 'Chris', 'Theresa',
       'Christopher', 'Rachel', 'Joan', 'Gabriella', 'Norman', 'Cristina',
       'Cassandra', 'Beth', 'Eddie', 'Valerie', 'Connie', 'Brad',
       'Wesley', 'Norma', 'Cathy', 'Traci', 'Arthur', 'Angelica', 'Alice',
       'Jimmy', 'Timothy', 'Mikayla', 'Tiffany', 'Dalton', 'Isaiah',
       'Sheila', 'Paige', 'Connor', 'Cassie', 'Kirk', 'Denise', 'Katrina',
       'Doris', 'Joseph', 'Glenn', 'Judy', 'Shannon', 'Ariana', 'Wanda',
       'Andrew', 'Joy', 'Christian', 'Austin', 'Marie', 'Scott',
       'Kristina', 'Kenneth', 'Drew', 'Pamela', 'Kimberly', 'Breanna',
       'Margaret', 'Parker', 'Tom', 'Caleb', 'Matthew', 'Stephanie',
       'Bernard', 'Ricky', 'Jasmine', 'Sara', 'Alexandria', 'Diana',
       'Michaela', 'Deanna', 'Johnathan', 'Terry', 'Amy', 'Collin',
       'Haley', 'Bradley', 'Leslie', 'Adam', 'Ashley', 'Riley', 'Cassidy',
       'Sharon', 'Daniel', 'Dan', 'Alexander', 'Nathan', 'Julie',
       'Brianna', 'Zachary', 'Terrence', 'Glen', 'Diane', 'Travis',
       'Kiara', 'Carol', 'Melinda', 'Victoria', 'Mindy', 'Adriana', 'Joe',
       'Amanda', 'Martha', 'Lori', 'Charles', 'Stefanie', 'Maria',
       'Carla', 'Melody', 'Chad', 'Kayla', 'Monique', 'Jeremiah',
       'Autumn', 'April', 'Tami', 'Susan', 'Sergio', 'Jeanette', 'Amber',
       'Vernon', 'Ricardo', 'Latasha', 'Marcus', 'Manuel', 'Annette',
       'Blake', 'Toni', 'Kara', 'Hayden', 'Gregory', 'Roy', 'Kari',
       'Jose', 'Darrell', 'Phyllis', 'Meagan', 'Katherine', 'Derrick',
       'Ariel', 'Keith', 'Judith', 'Alec', 'Justin', 'Dean', 'Benjamin',
       'Lonnie', 'Ian', 'Helen', 'Sean', 'Makayla', 'Tara', 'Deborah',
       'Lance', 'Rebecca', 'Ralph', 'Yvonne', 'Sabrina', 'Mckenzie',
       'Damon', 'Mason', 'Stuart', 'Alejandra', 'Ruben', 'Karl', 'Misty',
       'Hunter', 'Selena', 'Jack', 'Vicki', 'Jake', 'Luis', 'Eileen',
       'Gene', 'Brett', 'Dana', 'Candace', 'Tammy', 'Kaitlin', 'Juan',
       'Latoya', 'Billy', 'Cindy', 'Nancy', 'Veronica', 'Janice',
       'Rodney', 'Darren', 'Jody', 'Laurie', 'Briana', 'Clayton',
       'Carolyn', 'Aaron', 'Colin', 'Thomas', 'Jesse', 'Christie',
       'Jillian', 'Willie', 'Tristan', 'Kristy', 'Ann', 'Tyrone', 'Barry',
       'Tasha', 'Howard', 'Yvette', 'Kaitlyn', 'Richard', 'Anne',
       'Andres', 'Marissa', 'Angie', 'Colleen', 'Ernest', 'Taylor',
       'Johnny', 'Elijah', 'Jerome', 'Terri', 'Peter', 'Paula', 'Omar',
       'Gail', 'Wyatt', 'Levi', 'Mallory', 'Michelle', 'Ray', 'Alicia',
       'Gary', 'Rick', 'Tricia', 'Ronald', 'Rhonda', 'Christy', 'William',
       'Alisha', 'Rachael', 'Frederick', 'Jill', 'Carly', 'Olivia',
       'Tina', 'Jared', 'Steven', 'Kirsten', 'Claudia', 'Nathaniel',
       'Brittney', 'Perry', 'Audrey', 'Kathy', 'Jordan', 'John', 'Andrea',
       'Jesus', 'Pam', 'Brady', 'Jeffery', 'Roberta', 'Kathleen', 'Jacob',
       'Mandy', 'Jason', 'Clifford', 'Sylvia', 'Victor', 'Heidi', 'Tonya',
       'Philip', 'Regina', 'Kerry', 'Holly', 'Gregg', 'Dustin', 'Grace',
       'Gerald', 'Darin', 'Sue', 'Charlene', 'Ross', 'Katelyn', 'Trevor',
       'Douglas', 'Jenna', 'Linda', 'Zoe', 'Allen', 'Shelly', 'George',
       'David', 'Todd', 'Shawn', 'Sherry', 'Hannah', 'Whitney', 'Javier',
       'Isaac', 'Caitlyn', 'Wayne', 'Rickey', 'Carmen', 'Patricia',
       'Jeff', 'Karla', 'Shelia', 'Cole', 'Alyssa', 'Kathryn', 'Gavin',
       'Carl', 'Lawrence', 'Molly', 'Morgan', 'Kyle', 'Lynn', 'Lauren',
       'Tony', 'Tommy', 'Cristian', 'Debbie', 'Kristine', 'Kelsey',
       'Brian', 'Jon', 'Angel', 'Tammie', 'Evan', 'Jim', 'Lisa',
       'Lorraine', 'Jay', 'Cesar', 'James', 'Maurice', 'Fred', 'Kendra',
       'Courtney', 'Dennis', 'Tracie', 'Erika', 'Melvin', 'Elizabeth',
       'Cheyenne', 'Leroy', 'Malik', 'Evelyn', 'Fernando', 'Anthony',
       'Betty', 'Carlos', 'Jeffrey', 'Antonio', 'Dominique'], dtype=object)

In [31]:
df["Job Title"].value_counts()

Job Title
Buyer, retail                   196
Engineer, civil (consulting)    196
Counselling psychologist        193
Sports therapist                190
Environmental manager           190
                               ...
Architectural technologist      127
Teacher, music                  127
Print production planner        127
Careers information officer     126
Bookseller                      125
Name: count, Length: 639, dtype: int64

In [32]:
df = df.drop(columns=["Index"])

In [16]:
df.head()

,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
0,e09c4f4cbfEFaFd,Dawn,Trevino,Male,clintongood@example.org,360-423-5286,1972-01-17,"Teacher, primary school"
1,D781D28b845Ab9D,Dale,Mcknight,Male,clairebradshaw@example.org,9062423229,1931-01-31,"Development worker, community"
2,eda7EcaF87b2D80,Herbert,Bean,Female,johnnybooker@example.org,001-149-154-0679x1617,2018-02-10,Ceramics designer
3,E75ACea5D7AeC3e,Karen,Everett,Female,wkhan@example.org,870.294.7563x20939,1938-06-14,"Civil engineer, consulting"
4,9C4Df1246ddf543,Angela,Shea,Male,reginaldgarner@example.com,242.442.2978,1971-11-22,Health and safety adviser

In [35]:
df = df.rename(columns={"User Id": "User_ID",
                        "First Name": "First_Name",
                        "Last Name": "Last_Name",
                        "Sex": "Sex",
                        "Email": "Email",
                        "Phone": "Phone",
                        "Date of birth": "DOB",
                        "Job Title": "Job_Title"
})

In [38]:
df.head()

,User_ID,First_Name,Last_Name,Sex,E_mail,Phone,DOB,Job_Title
0,e09c4f4cbfEFaFd,Dawn,Trevino,Male,clintongood@example.org,360-423-5286,1972-01-17,"Teacher, primary school"
1,D781D28b845Ab9D,Dale,Mcknight,Male,clairebradshaw@example.org,9062423229,1931-01-31,"Development worker, community"
2,eda7EcaF87b2D80,Herbert,Bean,Female,johnnybooker@example.org,001-149-154-0679x1617,2018-02-10,Ceramics designer
3,E75ACea5D7AeC3e,Karen,Everett,Female,wkhan@example.org,870.294.7563x20939,1938-06-14,"Civil engineer, consulting"
4,9C4Df1246ddf543,Angela,Shea,Male,reginaldgarner@example.com,242.442.2978,1971-11-22,Health and safety adviser

In [43]:
new_order = [
    "User_ID", "First_Name", "Last_Name", "Sex", "DOB", "Email", "Phone", "Job_Title"
]

In [44]:
df = df.reindex(columns=new_order)

In [45]:
df.head()

,User_ID,First_Name,Last_Name,Sex,DOB,Email,Phone,Job_Title
0,e09c4f4cbfEFaFd,Dawn,Trevino,Male,1972-01-17,NaN,360-423-5286,"Teacher, primary school"
1,D781D28b845Ab9D,Dale,Mcknight,Male,1931-01-31,NaN,9062423229,"Development worker, community"
2,eda7EcaF87b2D80,Herbert,Bean,Female,2018-02-10,NaN,001-149-154-0679x1617,Ceramics designer
3,E75ACea5D7AeC3e,Karen,Everett,Female,1938-06-14,NaN,870.294.7563x20939,"Civil engineer, consulting"
4,9C4Df1246ddf543,Angela,Shea,Male,1971-11-22,NaN,242.442.2978,Health and safety adviser

In [ ]:
# Count missing values in each column
df.isna().sum()

User_ID            0
First_Name         0
Last_Name          0
Sex                0
DOB                0
Email         100000
Phone              0
Job_Title          0
dtype: int64

In [47]:
# Or as a percentage
df.isna().mean() * 100

User_ID         0.0
First_Name      0.0
Last_Name       0.0
Sex             0.0
DOB             0.0
Email         100.0
Phone           0.0
Job_Title       0.0
dtype: float64

In [48]:
# Drop rows with ANY missing value
df.dropna()

Empty DataFrame
Columns: [User_ID, First_Name, Last_Name, Sex, DOB, Email, Phone, Job_Title]
Index: []

In [49]:
# Drop rows where ALL values are missing
df.dropna(how='all')

,User_ID,First_Name,Last_Name,Sex,DOB,Email,Phone,Job_Title
0,e09c4f4cbfEFaFd,Dawn,Trevino,Male,1972-01-17,NaN,360-423-5286,"Teacher, primary school"
1,D781D28b845Ab9D,Dale,Mcknight,Male,1931-01-31,NaN,9062423229,"Development worker, community"
2,eda7EcaF87b2D80,Herbert,Bean,Female,2018-02-10,NaN,001-149-154-0679x1617,Ceramics designer
3,E75ACea5D7AeC3e,Karen,Everett,Female,1938-06-14,NaN,870.294.7563x20939,"Civil engineer, consulting"
4,9C4Df1246ddf543,Angela,Shea,Male,1971-11-22,NaN,242.442.2978,Health and safety adviser
...,...,...,...,...,...,...,...,...
99995,eDbebb82Bdf859c,Eduardo,Fuentes,Male,2015-09-02,NaN,971-408-5795x791,"Designer, graphic"
99996,78B30216f7Ad5eA,Marcus,Ferguson,Male,1978-01-30,NaN,001-183-966-1623x446,Cytogeneticist
99997,E0edBf053adCEc1,Marilyn,Benson,Male,1939-07-11,NaN,3010820886,Engineering geologist
99998,fA585A02f6A86C5,Felicia,Robbins,Female,1942-02-05,NaN,(753)522-4673,Clinical cytogeneticist
99999,FE35edEdE3BaC90,Jackie,Doyle,Male,1918-05-30,NaN,357.974.5692x909,"Teacher, special educational needs"

In [50]:
# Drop columns with ANY missing value
df.dropna(axis=1)

,User_ID,First_Name,Last_Name,Sex,DOB,Phone,Job_Title
0,e09c4f4cbfEFaFd,Dawn,Trevino,Male,1972-01-17,360-423-5286,"Teacher, primary school"
1,D781D28b845Ab9D,Dale,Mcknight,Male,1931-01-31,9062423229,"Development worker, community"
2,eda7EcaF87b2D80,Herbert,Bean,Female,2018-02-10,001-149-154-0679x1617,Ceramics designer
3,E75ACea5D7AeC3e,Karen,Everett,Female,1938-06-14,870.294.7563x20939,"Civil engineer, consulting"
4,9C4Df1246ddf543,Angela,Shea,Male,1971-11-22,242.442.2978,Health and safety adviser
...,...,...,...,...,...,...,...
99995,eDbebb82Bdf859c,Eduardo,Fuentes,Male,2015-09-02,971-408-5795x791,"Designer, graphic"
99996,78B30216f7Ad5eA,Marcus,Ferguson,Male,1978-01-30,001-183-966-1623x446,Cytogeneticist
99997,E0edBf053adCEc1,Marilyn,Benson,Male,1939-07-11,3010820886,Engineering geologist
99998,fA585A02f6A86C5,Felicia,Robbins,Female,1942-02-05,(753)522-4673,Clinical cytogeneticist
99999,FE35edEdE3BaC90,Jackie,Doyle,Male,1918-05-30,357.974.5692x909,"Teacher, special educational needs"

In [52]:
# Fill a single column with a constant
df['Phone'] = df['Phone'].fillna("Not Provided")

In [54]:
# Standardize text case
df['First_Name'] = df['First_Name'].str.lower()

In [55]:
# Remove leading/trailing spaces
df['Last_Name'] = df['Last_Name'].str.strip()

In [56]:
df['Sex'] = df['Sex'].replace({
    "M": "Male",
    "MALE": "Male",
    "male": "Male",
    "F": "Female",
    "FEMALE": "Female",
    "female": "Female"
})

In [57]:
df.head()

,User_ID,First_Name,Last_Name,Sex,DOB,Email,Phone,Job_Title
0,e09c4f4cbfEFaFd,dawn,Trevino,Male,1972-01-17,NaN,360-423-5286,"Teacher, primary school"
1,D781D28b845Ab9D,dale,Mcknight,Male,1931-01-31,NaN,9062423229,"Development worker, community"
2,eda7EcaF87b2D80,herbert,Bean,Female,2018-02-10,NaN,001-149-154-0679x1617,Ceramics designer
3,E75ACea5D7AeC3e,karen,Everett,Female,1938-06-14,NaN,870.294.7563x20939,"Civil engineer, consulting"
4,9C4Df1246ddf543,angela,Shea,Male,1971-11-22,NaN,242.442.2978,Health and safety adviser